;---------------------------
; MrK's XCOM EU/EW Ports Tier 3 Armour
;---------------------------
;Helmets
;---------------------------
;Tier 3
;---------------------------
;Reaper
[X1_Helmet_reaper_M X2BodyPartTemplate]
DisplayName="X-COM Reaper Helmet"
[X1_Helmet_reaper_F X2BodyPartTemplate]
DisplayName="X-COM Reaper Helmet"

;ReaperA
[X1_Helmet_reaperA_M X2BodyPartTemplate]
DisplayName="X-COM Reaper A Helmet"
[X1_Helmet_reaperA_F X2BodyPartTemplate]
DisplayName="X-COM Reaper A Helmet"

;ghost0
[X1_Helmet_ghost0_M X2BodyPartTemplate]
DisplayName="X-COM Titan 1 Helmet"
[X1_Helmet_ghost0_F X2BodyPartTemplate]
DisplayName="X-COM Titan 1 Helmet"

;ghost1
[X1_Helmet_ghost1_M X2BodyPartTemplate]
DisplayName="X-COM Titan 2 Helmet"
[X1_Helmet_ghost1_F X2BodyPartTemplate]
DisplayName="X-COM Titan 2 Helmet"

;ghost3
[X1_Helmet_ghost3_M X2BodyPartTemplate]
DisplayName="X-COM Titan 3 Helmet"
[X1_Helmet_ghost3_F X2BodyPartTemplate]
DisplayName="X-COM Titan 3 Helmet"

;ghost4
[X1_Helmet_ghost4_M X2BodyPartTemplate]
DisplayName="X-COM Titan 4 Helmet"
[X1_Helmet_ghost4_F X2BodyPartTemplate]
DisplayName="X-COM Titan 4 Helmet"

;Psi 1
[X1_Helmet_psi1_M X2BodyPartTemplate]
DisplayName="X-COM Psi Helmet"
[X1_Helmet_psi1_F X2BodyPartTemplate]
DisplayName="X-COM Psi Helmet"

;Psi 2
[X1_Helmet_psi2_M X2BodyPartTemplate]
DisplayName="X-COM Psi Skull Helmet"
[X1_Helmet_psi2_F X2BodyPartTemplate]
DisplayName="X-COM Psi Skull Helmet"

;Titan Arms LPW
[X1_TitanArmL_LPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_LPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmL_LPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_LPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"

;Titan Arms MPW
[X1_TitanArmL_MPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_MPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmL_MPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_MPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"

;Titan Arms HPW
[X1_TitanArmL_HPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_HPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmL_HPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_HPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"

;Titan Matte Arms LPW
[X1_TitanArmLM_LPW_M X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmRM_LPW_M X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmLM_LPW_F X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmRM_LPW_F X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"

;Titan Matte Arms MPW
[X1_TitanArmLM_MPW_M X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmRM_MPW_M X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmLM_MPW_F X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmRM_MPW_F X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"

;Titan Matte Arms HPW
[X1_TitanArmLM_HPW_M X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmRM_HPW_M X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmLM_HPW_F X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"
[X1_TitanArmRM_HPW_F X2BodyPartTemplate]
DisplayName="Base Matte Titan Arm"

;Titan Arms HA
[X1_TitanArmL_HA_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_HA_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmL_HA_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_HA_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"

;Titan Arms HA2
[X1_TitanArmL_HA2_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_HA2_M X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmL_HA2_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"
[X1_TitanArmR_HA2_F X2BodyPartTemplate]
DisplayName="Base Titan Arm"

;Future Ghost Arms LPW
[X1_GhostArmL_LPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmR_LPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmL_LPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmR_LPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"

;Future Ghost Arms MPW
[X1_GhostArmL_MPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmR_MPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmL_MPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmR_MPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"

;Future Ghost Arms HPW
[X1_GhostArmL_HPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmR_HPW_M X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmL_HPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"
[X1_GhostArmR_HPW_F X2BodyPartTemplate]
DisplayName="Base Titan Arm [To be replaced]"

;---------------------------
Conventional AR Kit
;---------------------------
[X1_KitIIIConvR_LP_M X2BodyPartTemplate]
DisplayName="Titan Medium (AR Kit)"
[X1_KitIIIConvL_LP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvR_MP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_MP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvR_HP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_HP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"

[X1_KitIIIConvR_LP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_LP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvR_MP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_MP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvR_HP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_HP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"

[X1_KitIIIConvThighs_LP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvThighs_MP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvThighs_HP_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"

[X1_KitIIIConvThighs_LP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvThighs_MP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvThighs_HP_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"

;Rage Armour
[X1_KitIIIConvR_HA_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_HA_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvR_HA_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_HA_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"

[X1_KitIIIConvR_HA2_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_HA2_M X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvR_HA2_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"
[X1_KitIIIConvL_HA2_F X2BodyPartTemplate]
DisplayName="Titan Medium(AR Kit)"

;---------------------------
Titan Deco 0
;---------------------------
[X1_TitanDeco0ArmR_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0ArmR_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0ArmR_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0ForeArmR_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmL_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmR_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmL_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmR_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmL_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0ForeArmR_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmL_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmR_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmL_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmR_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ForeArmL_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0Thighs_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0Thighs_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0Thighs_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0Thighs_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0Thighs_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0Thighs_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"

;Rage Armour
[X1_TitanDeco0ArmR_HA_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HA_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_HA_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HA_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"

[X1_TitanDeco0ArmR_HA2_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HA2_M X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmR_HA2_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"
[X1_TitanDeco0ArmL_HA2_F X2BodyPartTemplate]
DisplayName="Titan Deco 0"

;---------------------------
Titan Deco 1
;---------------------------
[X1_TitanDeco1ArmR_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmR_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmR_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1ArmR_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmR_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmR_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1ForeArmR_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmL_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmR_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmL_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmR_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmL_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1ForeArmR_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmL_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmR_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmL_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmR_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ForeArmL_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1Thighs_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Thighs_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Thighs_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1Thighs_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Thighs_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Thighs_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1Shins_LP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Shins_MP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Shins_HP_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1Shins_LP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Shins_MP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1Shins_HP_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"

;Rage Armour
[X1_TitanDeco1ArmR_HA_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_HA_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmR_HA_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_HA_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"

[X1_TitanDeco1ArmR_HA2_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_HA2_M X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmR_HA2_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"
[X1_TitanDeco1ArmL_HA2_F X2BodyPartTemplate]
DisplayName="Titan Deco 1"